zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1186/MIMXRT1186_cm33_COMMON.h
/* SRC_MIF_S28SPREGH - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AON_MIF_S28SPREGH base address */
  #define AON_MIF_S28SPREGH_BASE                   (0x54462000u)
  /** Peripheral AON_MIF_S28SPREGH base address */
  #define AON_MIF_S28SPREGH_BASE_NS                (0x44462000u)
  /** Peripheral AON_MIF_S28SPREGH base pointer */
  #define AON_MIF_S28SPREGH                        ((SRC_MIF_S28SPREGH_Type *)AON_MIF_S28SPREGH_BASE)
  /** Peripheral AON_MIF_S28SPREGH base pointer */
  #define AON_MIF_S28SPREGH_NS                     ((SRC_MIF_S28SPREGH_Type *)AON_MIF_S28SPREGH_BASE_NS)
  /** Peripheral WAKEUP_MIF_S28SPREGH base address */
  #define WAKEUP_MIF_S28SPREGH_BASE                (0x54462800u)
  /** Peripheral WAKEUP_MIF_S28SPREGH base address */
  #define WAKEUP_MIF_S28SPREGH_BASE_NS             (0x44462800u)
  /** Peripheral WAKEUP_MIF_S28SPREGH base pointer */
  #define WAKEUP_MIF_S28SPREGH                     ((SRC_MIF_S28SPREGH_Type *)WAKEUP_MIF_S28SPREGH_BASE)
  /** Peripheral WAKEUP_MIF_S28SPREGH base pointer */
  #define WAKEUP_MIF_S28SPREGH_NS                  ((SRC_MIF_S28SPREGH_Type *)WAKEUP_MIF_S28SPREGH_BASE_NS)
  /** Peripheral MEGA_MIF_S28SPREGH base address */
  #define MEGA_MIF_S28SPREGH_BASE                  (0x54463000u)
  /** Peripheral MEGA_MIF_S28SPREGH base address */
  #define MEGA_MIF_S28SPREGH_BASE_NS               (0x44463000u)
  /** Peripheral MEGA_MIF_S28SPREGH base pointer */
  #define MEGA_MIF_S28SPREGH                       ((SRC_MIF_S28SPREGH_Type *)MEGA_MIF_S28SPREGH_BASE)
  /** Peripheral MEGA_MIF_S28SPREGH base pointer */
  #define MEGA_MIF_S28SPREGH_NS                    ((SRC_MIF_S28SPREGH_Type *)MEGA_MIF_S28SPREGH_BASE_NS)
  /** Peripheral NETC_MIF_S28SPREGH base address */
  #define NETC_MIF_S28SPREGH_BASE                  (0x54463800u)
  /** Peripheral NETC_MIF_S28SPREGH base address */
  #define NETC_MIF_S28SPREGH_BASE_NS               (0x44463800u)
  /** Peripheral NETC_MIF_S28SPREGH base pointer */
  #define NETC_MIF_S28SPREGH                       ((SRC_MIF_S28SPREGH_Type *)NETC_MIF_S28SPREGH_BASE)
  /** Peripheral NETC_MIF_S28SPREGH base pointer */
  #define NETC_MIF_S28SPREGH_NS                    ((SRC_MIF_S28SPREGH_Type *)NETC_MIF_S28SPREGH_BASE_NS)
  /** Peripheral CM33PLATFORM_CACHE base address */
  #define CM33PLATFORM_CACHE_BASE                  (0x54464000u)
  /** Peripheral CM33PLATFORM_CACHE base address */
  #define CM33PLATFORM_CACHE_BASE_NS               (0x44464000u)
  /** Peripheral CM33PLATFORM_CACHE base pointer */
  #define CM33PLATFORM_CACHE                       ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_CACHE_BASE)
  /** Peripheral CM33PLATFORM_CACHE base pointer */
  #define CM33PLATFORM_CACHE_NS                    ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_CACHE_BASE_NS)
  /** Peripheral CM7PLATFORM_CACHE base address */
  #define CM7PLATFORM_CACHE_BASE                   (0x54464800u)
  /** Peripheral CM7PLATFORM_CACHE base address */
  #define CM7PLATFORM_CACHE_BASE_NS                (0x44464800u)
  /** Peripheral CM7PLATFORM_CACHE base pointer */
  #define CM7PLATFORM_CACHE                        ((SRC_MIF_S28SPREGH_Type *)CM7PLATFORM_CACHE_BASE)
  /** Peripheral CM7PLATFORM_CACHE base pointer */
  #define CM7PLATFORM_CACHE_NS                     ((SRC_MIF_S28SPREGH_Type *)CM7PLATFORM_CACHE_BASE_NS)
  /** Peripheral CM33PLATFORM_TCM base address */
  #define CM33PLATFORM_TCM_BASE                    (0x54464400u)
  /** Peripheral CM33PLATFORM_TCM base address */
  #define CM33PLATFORM_TCM_BASE_NS                 (0x44464400u)
  /** Peripheral CM33PLATFORM_TCM base pointer */
  #define CM33PLATFORM_TCM                         ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_TCM_BASE)
  /** Peripheral CM33PLATFORM_TCM base pointer */
  #define CM33PLATFORM_TCM_NS                      ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_TCM_BASE_NS)
  /** Array initializer of SRC_MIF_S28SPREGH peripheral base addresses */
  #define SRC_MIF_S28SPREGH_BASE_ADDRS             { AON_MIF_S28SPREGH_BASE, WAKEUP_MIF_S28SPREGH_BASE, MEGA_MIF_S28SPREGH_BASE, NETC_MIF_S28SPREGH_BASE, CM33PLATFORM_CACHE_BASE, CM7PLATFORM_CACHE_BASE, CM33PLATFORM_TCM_BASE }
  /** Array initializer of SRC_MIF_S28SPREGH peripheral base pointers */
  #define SRC_MIF_S28SPREGH_BASE_PTRS              { AON_MIF_S28SPREGH, WAKEUP_MIF_S28SPREGH, MEGA_MIF_S28SPREGH, NETC_MIF_S28SPREGH, CM33PLATFORM_CACHE, CM7PLATFORM_CACHE, CM33PLATFORM_TCM }
  /** Array initializer of SRC_MIF_S28SPREGH peripheral base addresses */
  #define SRC_MIF_S28SPREGH_BASE_ADDRS_NS          { AON_MIF_S28SPREGH_BASE_NS, WAKEUP_MIF_S28SPREGH_BASE_NS, MEGA_MIF_S28SPREGH_BASE_NS, NETC_MIF_S28SPREGH_BASE_NS, CM33PLATFORM_CACHE_BASE_NS, CM7PLATFORM_CACHE_BASE_NS, CM33PLATFORM_TCM_BASE_NS }
  /** Array initializer of SRC_MIF_S28SPREGH peripheral base pointers */
  #define SRC_MIF_S28SPREGH_BASE_PTRS_NS           { AON_MIF_S28SPREGH_NS, WAKEUP_MIF_S28SPREGH_NS, MEGA_MIF_S28SPREGH_NS, NETC_MIF_S28SPREGH_NS, CM33PLATFORM_CACHE_NS, CM7PLATFORM_CACHE_NS, CM33PLATFORM_TCM_NS }
#else
  /** Peripheral AON_MIF_S28SPREGH base address */
  #define AON_MIF_S28SPREGH_BASE                   (0x44462000u)
  /** Peripheral AON_MIF_S28SPREGH base pointer */
  #define AON_MIF_S28SPREGH                        ((SRC_MIF_S28SPREGH_Type *)AON_MIF_S28SPREGH_BASE)
  /** Peripheral WAKEUP_MIF_S28SPREGH base address */
  #define WAKEUP_MIF_S28SPREGH_BASE                (0x44462800u)
  /** Peripheral WAKEUP_MIF_S28SPREGH base pointer */
  #define WAKEUP_MIF_S28SPREGH                     ((SRC_MIF_S28SPREGH_Type *)WAKEUP_MIF_S28SPREGH_BASE)
  /** Peripheral MEGA_MIF_S28SPREGH base address */
  #define MEGA_MIF_S28SPREGH_BASE                  (0x44463000u)
  /** Peripheral MEGA_MIF_S28SPREGH base pointer */
  #define MEGA_MIF_S28SPREGH                       ((SRC_MIF_S28SPREGH_Type *)MEGA_MIF_S28SPREGH_BASE)
  /** Peripheral NETC_MIF_S28SPREGH base address */
  #define NETC_MIF_S28SPREGH_BASE                  (0x44463800u)
  /** Peripheral NETC_MIF_S28SPREGH base pointer */
  #define NETC_MIF_S28SPREGH                       ((SRC_MIF_S28SPREGH_Type *)NETC_MIF_S28SPREGH_BASE)
  /** Peripheral CM33PLATFORM_CACHE base address */
  #define CM33PLATFORM_CACHE_BASE                  (0x44464000u)
  /** Peripheral CM33PLATFORM_CACHE base pointer */
  #define CM33PLATFORM_CACHE                       ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_CACHE_BASE)
  /** Peripheral CM7PLATFORM_CACHE base address */
  #define CM7PLATFORM_CACHE_BASE                   (0x44464800u)
  /** Peripheral CM7PLATFORM_CACHE base pointer */
  #define CM7PLATFORM_CACHE                        ((SRC_MIF_S28SPREGH_Type *)CM7PLATFORM_CACHE_BASE)
  /** Peripheral CM33PLATFORM_TCM base address */
  #define CM33PLATFORM_TCM_BASE                    (0x44464400u)
  /** Peripheral CM33PLATFORM_TCM base pointer */
  #define CM33PLATFORM_TCM                         ((SRC_MIF_S28SPREGH_Type *)CM33PLATFORM_TCM_BASE)
  /** Array initializer of SRC_MIF_S28SPREGH peripheral base addresses */
  #define SRC_MIF_S28SPREGH_BASE_ADDRS             { AON_MIF_S28SPREGH_BASE, WAKEUP_MIF_S28SPREGH_BASE, MEGA_MIF_S28SPREGH_BASE, NETC_MIF_S28SPREGH_BASE, CM33PLATFORM_CACHE_BASE, CM7PLATFORM_CACHE_BASE, CM33PLATFORM_TCM_BASE }
  /** Array initializer of SRC_MIF_S28SPREGH peripheral base pointers */
  #define SRC_MIF_S28SPREGH_BASE_PTRS              { AON_MIF_S28SPREGH, WAKEUP_MIF_S28SPREGH, MEGA_MIF_S28SPREGH, NETC_MIF_S28SPREGH, CM33PLATFORM_CACHE, CM7PLATFORM_CACHE, CM33PLATFORM_TCM }
#endif

