zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1186/MIMXRT1186_cm33_COMMON.h
/* XBAR_NUM_OUT32 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XBAR2 base address */
  #define XBAR2_BASE                               (0x52760000u)
  /** Peripheral XBAR2 base address */
  #define XBAR2_BASE_NS                            (0x42760000u)
  /** Peripheral XBAR2 base pointer */
  #define XBAR2                                    ((XBAR_NUM_OUT32_Type *)XBAR2_BASE)
  /** Peripheral XBAR2 base pointer */
  #define XBAR2_NS                                 ((XBAR_NUM_OUT32_Type *)XBAR2_BASE_NS)
  /** Peripheral XBAR3 base address */
  #define XBAR3_BASE                               (0x52770000u)
  /** Peripheral XBAR3 base address */
  #define XBAR3_BASE_NS                            (0x42770000u)
  /** Peripheral XBAR3 base pointer */
  #define XBAR3                                    ((XBAR_NUM_OUT32_Type *)XBAR3_BASE)
  /** Peripheral XBAR3 base pointer */
  #define XBAR3_NS                                 ((XBAR_NUM_OUT32_Type *)XBAR3_BASE_NS)
  /** Array initializer of XBAR_NUM_OUT32 peripheral base addresses */
  #define XBAR_NUM_OUT32_BASE_ADDRS                { XBAR2_BASE, XBAR3_BASE }
  /** Array initializer of XBAR_NUM_OUT32 peripheral base pointers */
  #define XBAR_NUM_OUT32_BASE_PTRS                 { XBAR2, XBAR3 }
  /** Array initializer of XBAR_NUM_OUT32 peripheral base addresses */
  #define XBAR_NUM_OUT32_BASE_ADDRS_NS             { XBAR2_BASE_NS, XBAR3_BASE_NS }
  /** Array initializer of XBAR_NUM_OUT32 peripheral base pointers */
  #define XBAR_NUM_OUT32_BASE_PTRS_NS              { XBAR2_NS, XBAR3_NS }
#else
  /** Peripheral XBAR2 base address */
  #define XBAR2_BASE                               (0x42760000u)
  /** Peripheral XBAR2 base pointer */
  #define XBAR2                                    ((XBAR_NUM_OUT32_Type *)XBAR2_BASE)
  /** Peripheral XBAR3 base address */
  #define XBAR3_BASE                               (0x42770000u)
  /** Peripheral XBAR3 base pointer */
  #define XBAR3                                    ((XBAR_NUM_OUT32_Type *)XBAR3_BASE)
  /** Array initializer of XBAR_NUM_OUT32 peripheral base addresses */
  #define XBAR_NUM_OUT32_BASE_ADDRS                { XBAR2_BASE, XBAR3_BASE }
  /** Array initializer of XBAR_NUM_OUT32 peripheral base pointers */
  #define XBAR_NUM_OUT32_BASE_PTRS                 { XBAR2, XBAR3 }
#endif

/* XCACHE - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XCACHE_PC base address */
  #define XCACHE_PC_BASE                           (0x54400000u)
  /** Peripheral XCACHE_PC base address */
  #define XCACHE_PC_BASE_NS                        (0x44400000u)
  /** Peripheral XCACHE_PC base pointer */
  #define XCACHE_PC                                ((XCACHE_Type *)XCACHE_PC_BASE)
  /** Peripheral XCACHE_PC base pointer */
  #define XCACHE_PC_NS                             ((XCACHE_Type *)XCACHE_PC_BASE_NS)
  /** Peripheral XCACHE_PS base address */
  #define XCACHE_PS_BASE                           (0x54400800u)
  /** Peripheral XCACHE_PS base address */
  #define XCACHE_PS_BASE_NS                        (0x44400800u)
  /** Peripheral XCACHE_PS base pointer */
  #define XCACHE_PS                                ((XCACHE_Type *)XCACHE_PS_BASE)
  /** Peripheral XCACHE_PS base pointer */
  #define XCACHE_PS_NS                             ((XCACHE_Type *)XCACHE_PS_BASE_NS)
  /** Array initializer of XCACHE peripheral base addresses */
  #define XCACHE_BASE_ADDRS                        { XCACHE_PC_BASE, XCACHE_PS_BASE }
  /** Array initializer of XCACHE peripheral base pointers */
  #define XCACHE_BASE_PTRS                         { XCACHE_PC, XCACHE_PS }
  /** Array initializer of XCACHE peripheral base addresses */
  #define XCACHE_BASE_ADDRS_NS                     { XCACHE_PC_BASE_NS, XCACHE_PS_BASE_NS }
  /** Array initializer of XCACHE peripheral base pointers */
  #define XCACHE_BASE_PTRS_NS                      { XCACHE_PC_NS, XCACHE_PS_NS }
#else
  /** Peripheral XCACHE_PC base address */
  #define XCACHE_PC_BASE                           (0x44400000u)
  /** Peripheral XCACHE_PC base pointer */
  #define XCACHE_PC                                ((XCACHE_Type *)XCACHE_PC_BASE)
  /** Peripheral XCACHE_PS base address */
  #define XCACHE_PS_BASE                           (0x44400800u)
  /** Peripheral XCACHE_PS base pointer */
  #define XCACHE_PS                                ((XCACHE_Type *)XCACHE_PS_BASE)
  /** Array initializer of XCACHE peripheral base addresses */
  #define XCACHE_BASE_ADDRS                        { XCACHE_PC_BASE, XCACHE_PS_BASE }
  /** Array initializer of XCACHE peripheral base pointers */
  #define XCACHE_BASE_PTRS                         { XCACHE_PC, XCACHE_PS }
#endif
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
/** XCACHE physical memory base address */
 #define XCACHE_PHYMEM_BASES                       { 0x10000000u, 0x30000000u }
/** XCACHE physical memory size */
 #define XCACHE_PHYMEM_SIZES                       { 0x20000000u, 0xD0000000u }
/** XCACHE physical memory base address */
 #define XCACHE_PHYMEM_BASES_NS                    { 0x00000000u, 0x20000000u }
/** XCACHE physical memory size */
 #define XCACHE_PHYMEM_SIZES_NS                    { 0x20000000u, 0xE0000000u }
#else
/** XCACHE physical memory base address */
 #define XCACHE_PHYMEM_BASES                       { 0x00000000u, 0x20000000u }
/** XCACHE physical memory size */
 #define XCACHE_PHYMEM_SIZES                       { 0x20000000u, 0xE0000000u }
#endif


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MIMXRT1186_CM33_COMMON_H_ */

